In [28]:
import pandas as pd
import numpy as np

In [29]:
fitness = pd.read_csv('/mnt/New_Volume/Work_From_Home/Data/CardioGoodFitness.csv')

In [30]:
fitness.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [31]:
MaritalStatus = fitness['MaritalStatus']

In [32]:
new_fitness = fitness.drop('MaritalStatus',axis = 1)
new_fitness.head()

  Product  Age  Gender  Education  Usage  Fitness  Income  Miles
0   TM195   18    Male         14      3        4   29562    112
1   TM195   19    Male         15      2        3   31836     75
2   TM195   19  Female         14      4        3   30699     66
3   TM195   19    Male         12      3        3   32973     85
4   TM195   20    Male         13      4        2   35247     47

In [33]:
fitness.drop('MaritalStatus',axis = 1,inplace=True)

In [34]:
fitness.head()

  Product  Age  Gender  Education  Usage  Fitness  Income  Miles
0   TM195   18    Male         14      3        4   29562    112
1   TM195   19    Male         15      2        3   31836     75
2   TM195   19  Female         14      4        3   30699     66
3   TM195   19    Male         12      3        3   32973     85
4   TM195   20    Male         13      4        2   35247     47

In [35]:
df = pd.read_csv('/mnt/New_Volume/Work_From_Home/Data/DataScienceCleanStatement.csv')
df.head()

,Date,Description,InternationTransactionAmount,Category,Amount,TransactionUserName,TransactionType,IsoCurrency,Locality,City,State,Country,Unnamed: 12
0,12/12/2019,THE ROOM GURGAON ...,0,Video game,-127,VIBHORE GOYAL,Domestic,INR,Central Park II,Gurugram,Haryana,India,NaN
1,12/12/2019,CUT AND STYLEGURGAON ...,0,Occupation,-499,JASJIT KAUR,Domestic,INR,Sector 4,Gurugram,Haryana,India,NaN
2,12/12/2019,MUMUSOGURGAON ...,0,,-388,JASJIT KAUR,Domestic,INR,Sector 49,Gurugram,Haryana,India,NaN
3,12/12/2019,THE ROOM GURGAON ...,0,Video game,-108,VIBHORE GOYAL,Domestic,INR,Central Park II,Gurugram,Haryana,India,NaN
4,12/12/2019,THE ROOM GURGAON ...,0,Video game,-50,VIBHORE GOYAL,Domestic,INR,Central Park II,Gurugram,Haryana,India,NaN

In [36]:
df['Description']

KeyError: 'Description'

In [37]:
df.columns = [x.strip() for x in df.columns]

In [38]:
df.columns

Index(['Date', 'Description', 'InternationTransactionAmount', 'Category',
       'Amount', 'TransactionUserName', 'TransactionType', 'IsoCurrency',
       'Locality', 'City', 'State', 'Country', 'Unnamed: 12'],
      dtype='object')

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 13 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Date                          1470 non-null   object
 1   Description                   1470 non-null   object
 2   InternationTransactionAmount  1470 non-null   object
 3   Category                      1470 non-null   object
 4   Amount                        1470 non-null   object
 5   TransactionUserName           1470 non-null   object
 6   TransactionType               1470 non-null   object
 7   IsoCurrency                   1470 non-null   object
 8   Locality                      1302 non-null   object
 9   City                          1270 non-null   object
 10  State                         1245 non-null   object
 11  Country                       1307 non-null   object
 12  Unnamed: 12                   4 non-null      object
dtypes: object(13)
memory usage: 149.4+ KB

In [40]:
l = []
for i in range(len(df)):
    try:
        df['InternationTransactionAmount'].iloc[i] = np.float16(df['InternationTransactionAmount'].iloc[i])
    except:
        l.append(i)

In [41]:
l

[182]

In [42]:
 df['InternationTransactionAmount'].iloc[182]

' F-2/7OKH  Delhi                                     '